// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
//    Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// - створити функцію яка приймає масив та виводить кожен його елемент
const arr = [1,2,3,4,5,6];

function logElements(arr) {
    for (let e of arr){
        console.log(e);
    }
}
logElements(arr);

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

function paragraph(text){
    return document.write(`<p>${text}</p>`);
}

paragraph('Hello world');

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

function list(info){
    for(let i = 0; i < 3; i++){
        document.write(`<ul>
        <li>${info}</li>
</ul>`)
    }

}
list("Hello");

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
//    Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

function list1(number,info1){
    for(let i = 0; i < `${number}`; i++){
        document.write(`<ul>
        <li>${info1}</li>
</ul>`)
    }
}
list1(6, 'Hello Okten Mentor)))')